var set_dict = [
	["Серийный номер","Серийный номер изделия.","","INT","INTINPUT","DIAP",[10000,100000],"serno_____",0],	
	["Размещение","Название месторасположения устройства.","","STRING","STRINGINPUT","MAXLENGTH",50,"place_____",1],
	["Звуковой сигнал ИБЭП.","Включенность-выключенность звуковой сигнализации аварийных состояний ИБЭПа","","ONOFF","RADIOINPUT","",["ВЫКЛ.","ВКЛ."],"zv_on_____",2],
	["Отключение сигнала авария.","Автоматическое снятие сигнализации аварийных ситуаций ИБЭПа при их пропадании.","","ONOFF","RADIOINPUT","",["ВЫКЛ.","ВКЛ."],"av_avt____",4],
	["Umin.сети","Минимальное рабочее напряжение питающей сети","","INT","INTINPUT","DIAP",[1,220],"un_min_",5],
	["Umax.сети","Максимальное рабочее напряжение питающей сети","","INT","INTINPUT","DIAP",[1,300],"un_max_",6],
	["Параллельная работа источников","Включенность/выключенность параллельной работы источников","","ONOFF","RADIOINPUT","",["ВЫКЛ.","ВКЛ."],"par_______",3],
	["Время ротации источников","Время ротации источников в часах, рабочие значения 1 ~ 500, 0 - выключено","ч.","INT","INTINPUT","DIAP",[0,500],"rot_t_____",7],
	["Imax.","Ток переключения на большее количество БПС, дискретность 0.1А","A","INT/10","INTINPUT","DIAP",[10,1000],"i_max_____",8],
	["Imin.","Ток переключения на меньшее количество БПС, дискретность 0.1А","A","INT/10","INTINPUT","DIAP",[10,1000],"i_min_____",9],
	["Umax","Аварийное напряжение источника максимальное, дискретность 0.1В","В","INT/10","INTINPUT","DIAP",[10,3000],"u_max_i_",10],
	["Umin","Аварийное напряжение источника минимальное, дискретность 0.1В","В","INT/10","INTINPUT","DIAP",[10,3000],"u_min_i_",11],
	["Uб20","Напряжение содержания АКБ при t = 20 °С, дискретность 0.1В","В","INT/10","INTINPUT","DIAP",[150,800],"ub20_",12],
	["Uб0","Напряжение содержания АКБ при t = 0 °С, дискретность 0.1В","В","INT/10","INTINPUT","DIAP",[150,800],"ub0_",13],
	["Uсигн","Напряжение сигнализирующее разряд АКБ, дискретность 1В","В","INT","INTINPUT","DIAP",[15,100],"usign_",14],
	["Iз.max","Максимальный ток заряда АКБ, дискретность 0.1А","А","INT/10","INTINPUT","DIAP",[1,150],"izmax_",15],
	["tбат.сигн","Сигнальная температура батареи, дискретность 1°С","°С","INT","INTINPUT","DIAP",[10,100],"tbatsign_",16],
	["tбат.max","Аварийная температура батареи, дискретность 1°С","°С","INT","INTINPUT","DIAP",[10,100],"tbatmax_",17],
	["Uвыр.зар","Напряжение выравнивающего заряда, дискретность 0.1В","В","INT/10","INTINPUT","DIAP",[10,1000],"uvz_",18],
	["Tвыр.зар","Длительность выравнивающего заряда, дискретность 1ч.","ч.","INT","INTINPUT","DIAP",[1,24],"tvz_",19],
	["tи.сигн","Сигнальная температура источника, дискретность 1°С","°С","INT","INTINPUT","DIAP",[10,100],"tsign_",20],
	["tи.max","Аварийная температура источника, дискретность 1°С","°С","INT","INTINPUT","DIAP",[10,100],"tmax_",21],
	["Тз.а.с.","Время задержки включения БПС, дискретность 1 с.","с","INT","INTINPUT","DIAP",[0,10],"tzas_",22],
	["АПВ1","Включенность/выключенность АПВ первого уровня","","ONOFF","RADIOINPUT","",["ВЫКЛ.","ВКЛ."],"apv1_on_",23],
	["АПВ2","Включенность/выключенность АПВ второго уровня","","ONOFF","RADIOINPUT","",["ВЫКЛ.","ВКЛ."],"apv2_on_",24],
	["АПВ2период","Период работы АПВ второго уровня, дискретность 1ч.","ч.","INT","INTINPUT","DIAP",[1,24],"apv2_time_",25],
	["U0б","Напряжение поддержания при работе без АКБ , дискретность 0.1В","В","INT/10","INTINPUT","DIAP",[15,80],"u0b_",26],
	["Tбат.","Время проверки цепи АКБ, дискретность 1 мин. (0 - выключено)","мин.","INT","INTINPUT","DIAP",[5,60],"tbat_",27],
	["Iбк.","Контрольный ток цепи батареи , дискретность 0.01А","А","INT/100","INTINPUT","DIAP",[1,500],"ikb_",28],
	["Год","Установка текущего года","","INT","INTINPUT","DIAP",[1,99],"year_",29],
	["Месяц","Установка текущего месяца","","INT","INTINPUT","DIAP",[1,12],"month_",30],
	["День","Установка текущего дня","","INT","INTINPUT","DIAP",[1,31],"day_",31],
	["Час","Установка текущего часа","","INT","INTINPUT","DIAP",[0,23],"hour_",32],
	["Минуты","Установка текущих мигут","","INT","INTINPUT","DIAP",[0,59],"min_",33],
	["Секунды","Установка секунд","","INT","INTINPUT","DIAP",[0,59],"seс_",34]/*,
	["Синхронизация","Контрольный ток цепи батареи , дискретность 0.01А","А","INT/100","INTINPUT","DIAP",[1,500],"sinhr_",35]*/
];
var bps_status_string = [
	"",
	"работает",
	"в резерве",
	"работает, сильный нагрев",
	"заблокирован извне",
	"работает АПВ",
	"АВАРИЯ!!! Перегрев",
	"АВАРИЯ!!! Занижено выходное напряжение",
	"АВАРИЯ!!! Завышено выходное напряжение",
	"АВАРИЯ!!! Потеряна связь",
	"Отсутствует первичное питание"
];

var alarm_status_string = [
	"",
	"Авария питающей сети!!!",
	["Авария батареи №","!!! Батарея не подключена."],
	["Авария батареи №","!!! Несимметрия."],
	"Несимметрия батареи",
	"",
];

function pad(a,b){return(1e15+a+"").slice(-b)};

console.log("dict.js загружен");