var set_dict = [
	["Серийный номер","Серийный номер изделия.","","INT","INTINPUT","DIAP",[10000,100000],"serno_____"],
	["Размещение","Название месторасположения устройства.","","STRING","STRINGINPUT","MAXLENGTH",50,"place_____"],
	["Звуковой сигнал ИБЭП.","Включенность-выключенность звуковой сигнализации аварийных состояний ИБЭПа","","ONOFF","RADIOINPUT","",["ВЫКЛ.","ВКЛ."],"zv_on_____"],
	["Параллельная работа источников.","Параллельная работа источников.","","ONOFF","RADIOINPUT","",["ВЫКЛ.","ВКЛ."],"par_______"],
	/*Автоматическая отмена аварий.","Автоматическое снятие сигнализации аварийных ситуаций ИБЭПа при их пропадании.","","ONOFF","RADIOINPUT","",["ВЫКЛ.","ВКЛ."],"av_avt____"],*/
	["Uмакс","Максимальное выходное напряжение.","В","INT/10","INTINPUT","DIAP",[2000,2500],"umax______"]/*,
	["Uмин","Минимальное выходное напряжение","В","INT/10","INTINPUT","DIAP",[1500,2000]],
	["Uвых","В","INT/100","INCDEC",1500,2000,"Требуемое выходное напряжение"],
	["Местоположение","","STRING","INCDEC","","","Максимальное выходное напряжение"]*/
];
var bps_status_string = [
	"",
	"работает",
	"в резерве",
	"работает, сильный нагрев",
	"заблокирован извне",
	"работает АПВ",
	"АВАРИЯ!!! Перегрев",
	"АВАРИЯ!!! Занижено выходное напряжение",
	"АВАРИЯ!!! Завышено выходное напряжение",
	"АВАРИЯ!!! Потеряна связь",
	"Отсутствует первичное питание"
];

var alarm_status_string = [
	"",
	"Авария питающей сети!!!",
	["Авария батареи №","!!! Батарея не подключена."],
	["Авария батареи №","!!! Несимметрия."],
	"Несимметрия батареи",
	"",
];

function pad(a,b){return(1e15+a+"").slice(-b)};

console.log("dict.js загружен");